MOCKED_DATA = """
{
    "status": "success",
    "totalResults": 1547,
    "results": [
        {
            "title": "Эдоган отменил предвыборные мероприятия на один день по рекомендации врачей",
            "link": "https://aif.ru/politics/edogan_otmenil_predvybornye_meropriyatiya_na_odin_den_po_rekomendacii_vrachey",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Президент Турции поблагодарил граждан за беспокойство о его здоровье.",
            "content": "Президент Турции Реджеп Тайип Эрдоган по рекомендации врачей отменил все предвыборные мероприятия, которые были намечены на 26 апреля. Об этом лидер страны сообщил в своем Telegram-канале. «Сегодня буду отдыхать дома по совету наших врачей», - написал он. Эрдоган пообещал, что возобновит свои выступления перед избирателями с 27 апреля. Президент также поблагодарил всех, кто передал ему свои пожелания и молитвы в связи с недомоганием. Ранее , что интервью с Эрдоганом было внезапно прервано из-за плохого самочувствия турецкого лидера. Он пояснил, что из-за плотного предвыборного графика заболел желудочным гриппом. Напомним, Эрдоган официальную предвыборную кампанию. Он обещает гражданам снижение инфляции и обеспечение устойчивого экономического роста для страны.",
            "pubDate": "2023-04-26 15:18:20",
            "image_url": null,
            "source_id": "aif",
            "category": [
                "top"
            ],
            "country": [
                "russia"
            ],
            "language": "russian"
        },
        {
            "title": "Солист «Uma2rmaH» посетил столичный пункт отбора контрактников",
            "link": "https://aif.ru/society/army/solist_uma2rmah_posetil_stolichnyy_punkt_otbora_kontraktnikov",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Владимир Кристовский высоко оценил созданные в столичном пункте отбора на службу по контракту условия.",
            "content": "Российский музыкант и лидер отечественной рок-группы Uma2rmaH Владимир Кристовский дал высокую оценку созданным в столичном пункте отбора на военную службу по контракту условиям. Вокалист выразил мнение, что аналогичные пункты отбора следует открыть и в других регионах страны. По словам Кристовского, в РФ есть много людей с военной подготовкой, которые хотели бы получить возможность «работать военными». «Есть зоны отдыха, есть столовая. Много специалистов, которые обслуживают и контролируют работу», – отметил музыкант во время посещения пункта. Напомним, ранее столичный пункт отбора на службу по контракту посетили журналист , советский и российский певец певица и ряд других известных деятелей культуры и политики.",
            "pubDate": "2023-04-26 13:25:25",
            "image_url": null,
            "source_id": "aif",
            "category": [
                "top"
            ],
            "country": [
                "russia"
            ],
            "language": "russian"
        },
        {
            "title": "Очередные забастовки транспорта в Германии - Deutsche Bahn объявила о провале переговоров с EVG",
            "link": "https://www.mknews.de/social/2023/04/26/ocherednye-zabastovki-transporta-v-germanii-deutsche-bahn-obyavila-o-provale-peregovorov-s-evg.html",
            "keywords": [
                "Общество"
            ],
            "creator": null,
            "video_url": null,
            "description": "Deutsche Bahn объявила о завершении третьего раунда переговоров по коллективному договору с профсоюзом железнодорожников и транспортников EVG — результата по–прежнему нет. По данным Deutsche Bahn, следующая дата переговоров между двумя сторонами назначена на конец мая. Новости Германии по-русски",
            "content": "Deutsche Bahn объявила о завершении третьего раунда переговоров по коллективному договору с профсоюзом железнодорожников и транспортников EVG — результата по–прежнему нет. По данным Deutsche Bahn, следующая дата переговоров между двумя сторонами назначена на конец мая. Профсоюз работников железных дорог и транспорта (EVG) выразил «большое раздражение» решением Deutsche Bahn прекратить третий раунд коллективных переговоров. «Иными словами, могут быть новые забастовки», — заявил в Фульде представитель EVG на переговорах Кристиан Лорох. При этом он не назвал никаких конкретных планов на данный момент. EVG критикует железные дороги «Вместо того, чтобы вместе искать пути к договоренностям, переговорщик DB AG собирает вещи и покидает место встречи, — критикует Лорох. — Мы хотели двигаться вперед большими шагами, для чего уже продлили свое пребывание в Фульде». DB отвергает обвинения Ранее Deutsche Bahn объявила о завершении третьего раунда переговоров. Причиной стал отказ профсоюза вести дискуссию по новому предложению, сделанному Deutsche Bahn, объявила компания, находящаяся в федеральной собственности. «Мы сделали огромный шаг навстречу профсоюзу. С другой стороны, мы находимся в тупике», — сказал Мартин Зайлер, член совета директоров Deutsche Bahn, отвечающий за персонал. Вот что требует EVG На переговорах с железнодорожной отраслью EVG требует увеличения зарплаты, по меньшей мере, на 650 евро в месяц или 12% для верхних доходов, а также продолжительности действия договора на протяжении двенадцати месяцев. Федеральная компания Deutsche Bahn хочет базировать свое предложение на соглашении, достигнутом недавно государственным сектором. Об этом говорит Германия: Какие регионы Германии пострадают от демографического кризиса 660 000 пенсионеров в Германии — вынуждены просить социальную помощь Взгляд из Германии — выявление болезни Паркинсона еще до появления симптомов. Новый тест должен сделать это возможным Крах торговли в Германии — 9000 магазинов на грани закрытия Миллионы жителей Германии не пользуются интернетом Германия — новые правила продажи фруктов и овощей с дефектами. Что станет дешевле Зарплаты 2,5 миллионов жителей Германии возрастут - кто получит больше денег 328 млн обязательных сборов для ARD - повысят ли в Германии плату за телевещание Планы ХДС — повышение пенсионного возраста, изменения пенсионного обеспечение компаний и частном пенсионном страховании Путешествия по Германии, велосипеды, собаки — что возможно с Deutschlandticket за 49 евро Как жителю Германии получить наследство в России, или если наследодатель умер в ФРГ",
            "pubDate": "2023-04-26 12:52:06",
            "image_url": "https://static.mk.ru/upload/entities/2023/04/26/14/articles/detailPicture/80/9d/74/03/6bf8c803a3dcee78ae439c6fea067dcd.jpg",
            "source_id": "mk",
            "category": [
                "top"
            ],
            "country": [
                "russia"
            ],
            "language": "russian"
        },
        {
            "title": "Грабителя оперативно задержали в брянском Климово",
            "link": "https://www.mkbryansk.ru/incident/2023/04/26/grabitelya-operativno-zaderzhali-v-bryanskom-klimovo.html",
            "keywords": [
                "Происшествия"
            ],
            "creator": null,
            "video_url": null,
            "description": "В поселке Климово задержали грабителя, сбежавшего с чужим телефоном",
            "content": "В поселке Климово задержали грабителя, сбежавшего с чужим телефоном. О происшествии рассказали в пресс-службе регионального УМВД. В полицию обратился 36-летний местный житель, у которого на улице прямо из рук выхватили гаджет. Неизвестный злоумышленник стремительно скрылся с места инцидента с похищенным мобильным. Во время расследования стражи порядка вышли на след 36-летнего мужчины. Ранее подозреваемый отбывал срок за умышленное причинение тяжкого вреда здоровью. Его причастность к грабежу нашла подтверждение. И чужой телефон у злоумышленника изъяли. Благо, он не успел распорядиться похищенным имуществом. Теперь фигурант может снова попасть в колонию на срок до четырех лет. В отношении него возбуждено уголовное дело по статье «Грабеж».",
            "pubDate": "2023-04-26 12:51:25",
            "image_url": "https://static.mk.ru/upload/entities/2023/04/26/14/articles/detailPicture/e8/cb/65/13/f4dbc458cf66390fabacfaae61889d4a.jpg",
            "source_id": "mk",
            "category": [
                "top"
            ],
            "country": [
                "russia"
            ],
            "language": "russian"
        },
        {
            "title": "В Курской области 33-летний мужчина снимал порнографию с двумя подростками",
            "link": "https://chr.mk.ru/incident/2023/04/26/v-kurskoy-oblasti-33letniy-muzhchina-snimal-pornografiyu-s-dvumya-podrostkami.html",
            "keywords": [
                "Происшествия"
            ],
            "creator": null,
            "video_url": null,
            "description": "В Курской области возбуждено уголовное дело по факту действий сексуального характера в отношении несовершеннолетних, а также использование несовершеннолетних в изготовлении порнографических материалов",
            "content": "В Курской области возбуждено уголовное дело по факту действий сексуального характера в отношении несовершеннолетних, а также использование несовершеннолетних в изготовлении порнографических материалов. Подозреваемым по уголовному делу проходит 33-летний мужчина. Об этом рассказали в пресс-службе Следственного управления Следственного комитета. Следствие полагает, что с ноября 2021 года по февраль 2022 года мужчина отправлял двум 13-летним потерпевшим фото и видеоматериалы порнографического содержания. Мужчина общался с детьми с помощью видеозвонков, в ходе которых фотографировал и снимал на видео школьников. Данные фото- и видеоматериалы изготавливались обвиняемым для удовлетворения своих сексуальных потребностей. Материалы уголовного дела уже направили в суд. В скором времени злоумышленник узнает приговор.",
            "pubDate": "2023-04-26 12:51:16",
            "image_url": "https://static.mk.ru/upload/entities/2023/04/26/15/articles/detailPicture/74/08/36/1c/25ac2dbf82907fe1d1bf0a718bdb6d5e.jpg",
            "source_id": "mk",
            "category": [
                "top"
            ],
            "country": [
                "russia"
            ],
            "language": "russian"
        },
        {
            "title": "В ГД назвали зеркальной мерой указ Путина о блокировке иностранных активов",
            "link": "https://aif.ru/politics/russia/v_gd_nazvali_zerkalnoy_meroy_ukaz_putina_o_blokirovke_inostrannyh_aktivov",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "У России есть чем ответить на враждебные шаги Запада, считает депутат Олег Матвейчев.",
            "content": "Новый указ президента Владимира Путина, который допускает передачу иностранных активов под временное управление Росимущества в случае конфискации в США и других странах Запада собственности России – это зеркальная мера в ответ на антироссийские санкции. Об этом aif.ru заявил зампредседателя комитета Госдумы по информационной политике, профессор Финансового университета при правительстве РФ Олег Матвейчев. «Это зеркальная мера в ответ на действия Запада, и она адекватна сложившейся ситуации, – сказал Матвейчев. – Действия Запада по аресту имущества России давно возмущают наших граждан. Мы можем на это ответить, поскольку иностранных активов в нашей стране находится примерно на такую же сумму, что и российских активов на Западе. Если враждебные шаги продолжатся, мы в накладе не останемся». Указ о введении временного управления активами лиц из недружественных стран в ответ на изъятие или ограничение прав на российское имущество за рубежом Путин во вторник. Как следует из документа, в случае таких недружественных действий или возникновения «угрозы национальной, экономической, энергетической и иным видам безопасности» и обороноспособности России вводится временное управление в отношении имущества и активов лиц из недружественных стран в России. Тем же указом временное управление уже введено в отношении компаний «Юнипро» и «Фортум».",
            "pubDate": "2023-04-26 11:32:19",
            "image_url": null,
            "source_id": "aif",
            "category": [
                "top"
            ],
            "country": [
                "russia"
            ],
            "language": "russian"
        },
        {
            "title": "Эрдоган запланировал переговоры с Путиным",
            "link": "https://lenta.ru/news/2023/04/26/erdi/",
            "keywords": [
                "Мир"
            ],
            "creator": [
                "Анастасия Заикина"
            ],
            "video_url": null,
            "description": "Президент Турции Реджеп Тайип Эрдоган запланировал телефонные переговоры с лидером России Владимиром Путиным.",
            "content": null,
            "pubDate": "2023-04-26 09:03:00",
            "image_url": "https://icdn.lenta.ru/images/2023/04/26/12/20230426120250836/pic_1089e6dca53af1d8a283496f8f8155c4.jpg",
            "source_id": "lenta",
            "category": [
                "top"
            ],
            "country": [
                "russia"
            ],
            "language": "russian"
        },
        {
            "title": "Купленные за бесценок вазы с ярмарки оценили в 122 тысячи рублей",
            "link": "https://lenta.ru/news/2023/04/26/vases/",
            "keywords": [
                "Из жизни"
            ],
            "creator": [
                "Алиса Удовик"
            ],
            "video_url": null,
            "description": "65-летняя жительница Великобритании Кристин Рим, купившая на распродаже вазы за бесценок, продаст их на аукционе и получит 1,2 тысячи фунтов стерлингов. Женщина нашла две стеклянные вазы на ярмарке пять лет назад, когда жила в Испании. Она купила сосуды за восемь евро и хранила их в своем доме.",
            "content": null,
            "pubDate": "2023-04-26 09:02:06",
            "image_url": "https://icdn.lenta.ru/images/2023/04/25/10/20230425100137738/pic_3bfa5c5ea16100d0e2fc7fb2548f10f1.jpg",
            "source_id": "lenta",
            "category": [
                "top"
            ],
            "country": [
                "russia"
            ],
            "language": "russian"
        },
        {
            "title": "В Госдуме предложили россиянам самим защищать границы",
            "link": "https://lenta.ru/news/2023/04/26/granitsy/",
            "keywords": [
                "Россия"
            ],
            "creator": [
                "Анастасия Шейкина"
            ],
            "video_url": null,
            "description": "Россиянам, которые добровольно вступили в состав народной дружины, можно поручить охранять государственные границы. С таким предложением выступил глава комитета Госдумы Андрей Картаполов. По его словам, практика защиты границ местными жителями на добровольной основе существует в Европе.",
            "content": null,
            "pubDate": "2023-04-26 08:58:14",
            "image_url": "https://icdn.lenta.ru/images/2023/04/26/11/20230426113726603/pic_acb9130a88121cc06dbe9fa600df5257.jpeg",
            "source_id": "lenta",
            "category": [
                "top"
            ],
            "country": [
                "russia"
            ],
            "language": "russian"
        },
        {
            "title": "Неопознанный квадрокоптер упал на территорию Мосгорсуда",
            "link": "https://lenta.ru/news/2023/04/26/suddd/",
            "keywords": [
                "Россия"
            ],
            "creator": [
                "Анна Щербакова"
            ],
            "video_url": null,
            "description": "Неопознанный квадрокоптер упал на территории Московского городского суда. По сведениям Telegram-канала «112», за 15 минут до окончания рабочего дня судей дежурная поста охраны заметила падающий в зону ее ответственности беспилотник. Женщина сразу же обратилась в полицию.",
            "content": null,
            "pubDate": "2023-04-26 08:58:00",
            "image_url": "https://icdn.lenta.ru/images/2023/04/26/12/20230426120001142/pic_f61ab182d6d4edc0fcb09db8467cd169.jpg",
            "source_id": "lenta",
            "category": [
                "top"
            ],
            "country": [
                "russia"
            ],
            "language": "russian"
        }
    ],
    "nextPage": "168249948094dd700bc984ac6d86459b4aefdb8896"
}"""